pokedex-rails-backend/app/controllers/api/pokemon_controller.rb

    def show
        # debugger
        @pokemon = Pokemon.find(params[:id])
---
SELECT "pokemons".* FROM "pokemons" WHERE "pokemons"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]